{
  "NpcIds" : [],
  "Rooms" : 
  [
    {
      "Id": 0,
      "Name": "Submarine",
      "ShortDesc": "Submarine",
      "MessageOnArrival": "The first words you can hear through buzzing speakers are of the ship's AI:\nHello I'm Hal! I will take you to the surface ship, which will transport you directly to the shores of West Africa and then down the Congo River.\nBut first, you will need some background on your mission topic.\nDue to the increasing surface temperature, wildfires arouse more and more often in the jungles of Africa. Our newest study has revealed that with a pace of only two deaths of giraffes per year, the spicies would go distinct in just 15 years.\nIts overall population stands at around 2,300 individuals. As you can see, these numbers are rather dreadful. That is why this mission is crucial for preserving our planet's biodiversity.” It says, with its emotionless robotic voice.",
      "LongDesc": "Submarine is small, but quaint in front of you there is a big terminal, earphone",
      "MissionDescription": "First you’ll need to locate the giraffe before the fire spreads, then escort it back to safety, ensuring it will stay secured in the future. Our local watch team calls her Elizabeth. They registered her seldomly responding to that name. She loves acacia leaves, but she also likes to overeat it leaving her in state of exhaustion. She is shy, and scared of people because of widespread of illegal hunting in these parts of the world\nIn front of you there is a earphone, you can ask me to repeat my directions whenever you forget them.\nGood Luck!",
      "Actions": ["take", "hit", "talk", "repeat", "leave/ just go south?"],
      "ActionsContent": "- Pick up the earphone - hit the control panel with all  your strength - tell Hal to start the journey",
      "MessageOnDeparture": ""
    },
    {
      "Id": 1,
      "Name": "Camp",
      "MessageOnArrival": "Leaving the ship, you catch a sight of your stationary team waiting for you in the cool shade of the trees. They introduce themselfs as Josh, Nebula and Kenny. Then they lead you to their camp.",
      "ShortDesc": "Camp in a jungle - middle of Africa",
      "LongDesc": "Camp is rather small, one tatched house or more like a barn equipped with modern devices, maps and sleeping bags laying on the floor. You notice a gun and a machete, laying on the joshes desk, a small tree planted in the corner of a room and an exit. Your teammates are scattered around the place each of them engrossed in their own tasks.",
      "MissionDescription": "First you’ll need to locate the giraffe before the fire spreads, then escort it back to safety, ensuring it will stay secured in the future. Our local watch team calls her Elizabeth. They registered her seldomly responding to that name. For more you'll need to ask Mandarine. I just here to keep an eye on everything.",
      "ExtendedDescription": "She loves acacia leaves, but she also likes to overeat it leaving her in state of exhaustion. She is shy, and scared of people because of widespread of illegal hunting in these parts of the world\n",
      "ActionsContent": "Actions: - search the sleeping bags- pick up the gun- talk to: [name]- look at the plant (its acacia, next to it is a bottle of water)- peruse the map- leave ( if didnt look at the map, message is: you dont know where to go, you go back",
      "MessageOnDeparture": "As you’re leaving you hear that you should be prepared for everyting and hasty escape, because the fire is getting closer."
    },
    {
      "Id": 2,
      "Name": "Jungle",
      "MessageOnArrival": "You follow the directions, you get through the thicket of a jungle with each step you feel the heat getting more and more unberable, after about 15 minutes, you get a glimpse of your goal. There she is covered in spots, struggilng to get her leg free from the roots of a tree she got stuck in. You see the forest getting closer and closer.",
      "LongDesc": "",
      "MissionDescription": "First you’ll need to locate the giraffe before the fire spreads, then escort it back to safety, ensuring it will stay secured in the future. Our local watch team calls her Elizabeth. They registered her seldomly responding to that name. She loves acacia leaves, but she also likes to overeat it leaving her in state of exhaustion. She is shy, and scared of people because of widespread of illegal hunting in these parts of the world\n",
      "Actions": ["search", "talk", "look at", "leave"],
      "ActionsContent": "- if item acacia: feed her,- if machet: cut her leg,- pull her leg,- put on the leash,- after one action  [TIMER STARTS]- After you pull her leg out:- If you feed her acacia:- put on leash (if didn’t do it earlier)- pet her,- feed her more acacia,- if you did not feed her acacia and did not put on the leash she runs away:- approach her slowly,- scream at her,- throw a leash at her- run away from the fire- quick time event like go left right when you are running away from the fire- as you're leaving the jungle the poachers trap await",
      "MessageOnDeparture": ""
    }

  ]
}