{
  "Rooms" : 
  [
    {
      "Id": 0,
      "Name": "Submarine",
      "ShortDesc": "Submarine",
      "MessageOnArrival": "The first words you can hear through buzzing speakers are of the ship's AI:\nHello I'm Hal! I will take you to the surface ship, which will transport you directly to the shores of West Africa and then down the Congo River.\nBut first, you will need some background on your mission topic.\nDue to the increasing surface temperature, wildfires arouse more and more often in the jungles of Africa.\nOur newest study has revealed that with a pace of only two deaths of giraffes per year, the spicies would go distinct in just 15 years.\nIts overall population stands at around 2,300 individuals. As you can see, these numbers are rather dreadful.\nThat is why this mission is crucial for preserving our planet's biodiversity.” It says, with its emotionless robotic voice.",
      "LongDesc": "Submarine is small, but quaint in front of you there is a big terminal, earphone",
      "MissionDescription": "In front of you there is a earphone, you can ask me to repeat my directions whenever you forget them.\nGood Luck!"
    },
    {
      "Id": 1,
      "Name": "Camp",
      "MessageOnArrival": "Leaving the ship, you catch a sight of your stationary team waiting for you in the cool shade of the trees.\nThey introduce themselfs as Josh, Mandarine and Kenny. Then they lead you to their camp.",
      "ShortDesc": "Camp in a jungle - in heart of darkness",
      "LongDesc": "Camp is rather small, one tatched house or more like a barn equipped with modern devices, maps and sleeping bags laying on the floor.\nYou notice a gun and a machete, laying on the joshes desk, a small tree planted in the corner of a room and an exit.\nYour teammates are scattered around the place each of them engrossed in their own tasks.",
    "MissionDescription": "First you’ll need to locate the giraffe before the fire spreads, then escort it back to safety, ensuring it will stay secured in the future. Our local watch team calls her Elizabeth.\nThey registered her seldomly responding to that name.",
      "ExtendedDescription": "She loves acacia leaves, but she also likes to overeat it leaving her in state of exhaustion.\nShe is shy, and scared of people because of widespread of illegal hunting in these parts of the world\n",
      "MessageOnDeparture": "As you’re leaving you hear that you should be prepared for everyting and hasty escape, because the fire is getting closer."
    },
    {
      "Id": 2,
      "Name": "Jungle",
      "MessageOnArrival": "You follow the directions, you get through the thicket of a jungle with each step you feel the heat getting more and more unberable, after about 15 minutes, you get a glimpse of your goal.\nThere she is covered in spots, struggilng to get her leg free from the roots of a tree she got stuck in. You see the forest getting closer and closer.",
      "ShortDesc":"Deep in the jungle",
      "LongDesc": "Towering trees with thick canopies form a green cathedral, their leaves creating a dappled dance of sunlight on the forest floor.\nVines hang like nature's chandeliers, ready to swing and twist with the slightest breeze.\nThe air is thick with humidity, a tangible presence that wraps around you like a warm, damp cloak. Strange and exotic calls echo through the foliage—a cacophony of chirps, hoots, and mysterious rustlings.\nThe scent of damp earth, rich vegetation, and the sweet perfume of blooming flowers permeates the air, creating an olfactory symphony that signals the jungle's vibrant vitality.\nIt's not just a place, it's a living, breathing entity, an ecosystem pulsating with the rhythm of survival and the beauty of untamed nature.",
      "MissionDescription": "First you’ll need to locate the giraffe before the fire spreads, then escort it back to safety, ensuring it will stay secured in the future. Our local watch team calls her Elizabeth.\nThey registered her seldomly responding to that name. She loves acacia leaves, but she also likes to overeat it leaving her in state of exhaustion.\nShe is shy, and scared of people because of widespread of illegal hunting in these parts of the world. She is also very jelaous if she hears you saying someones elses name she won't forgive that.\n",
      "MessageOnDeparture": ""
    }

  ]
}